import numpy as np
np.random.seed(31415926)

# 150 нормально распределенных значений с дисперсией 0.01.
u = np.random.normal(size=150, scale=0.1)

# Матрица 150 x 3, первый столбец состоит из единиц,
# второй и третий столбцы --- N(0, 1).
Z = np.empty((150, 3))
Z[:, 0] = 1.
Z[:, 1:] = np.random.normal(size=(150, 2))

# Матрица 150 x 3.
# Второй и третий столбцы Z и X совпадают.
# Первый столбец равен:
# X = 0.5 + 1. * Z[1] + 2. * Z[2] + u
X = Z.copy()
X[:, 0] = Z @ np.array([0.5, 1, 2]) + u

print(np.round(np.linalg.inv(Z.T @ Z) @ Z.T @ X, 6))
